In [7]:
import pandas as pd
import numpy as np
from statsmodels.stats.weightstats import ztest
import scipy.stats
from scipy.stats import skew, f_oneway, pearsonr, ttest_rel, chi2_contingency, spearmanr, shapiro
import seaborn as sns
import matplotlib.pyplot as plt

## Importação da planilha

In [9]:
file_path = './dataset/100miles.xlsx'

In [13]:
data_2024 = pd.read_excel(file_path, sheet_name='2024')
data_2023 = pd.read_excel(file_path, sheet_name='2023')

In [19]:
data_2023.head(3)

   Place First_Name   Last_Name       City State  Age Gender      Time
0      1       Mike     Alberts  Melbourne    FL   34      M  18:33:06
1      2       Matt     Clapper        NaN   USA   41      M  19:21:53
2      3      Sarah  Raaymakers     Odessa    FL   39      F  20:43:19

In [20]:
data_2024.head(4)

   Place First_Name Last_Name        City State  Age Gender      Time
0      1      Lucas     Vidal  Cape Coral    FL   38      M  19:43:00
1      2    Brandon  Westover     Orlando    FL   45      M  21:15:00
2      3      Lucas  Hathaway     Atlanta    GA   34      M  23:31:36
3      4       Sage     Lyons    Sarasota    FL   27      F  23:37:05

## Limpeza dos dados

In [21]:
data_2024['Full_name'] = data_2024['First_Name'] + ' ' + data_2024['Last_Name']

In [23]:
data_2024.head(3)

,Place,First_Name,Last_Name,City,State,Age,Gender,Time,Full_name
0,1,Lucas,Vidal,Cape Coral,FL,38,M,19:43:00,Lucas Vidal
1,2,Brandon,Westover,Orlando,FL,45,M,21:15:00,Brandon Westover
2,3,Lucas,Hathaway,Atlanta,GA,34,M,23:31:36,Lucas Hathaway

In [22]:
data_2023['Full_name'] = data_2023['First_Name'] + ' ' + data_2023['Last_Name']

In [24]:
data_2023.head(3)

,Place,First_Name,Last_Name,City,State,Age,Gender,Time,Full_name
0,1,Mike,Alberts,Melbourne,FL,34,M,18:33:06,Mike Alberts
1,2,Matt,Clapper,NaN,USA,41,M,19:21:53,Matt Clapper
2,3,Sarah,Raaymakers,Odessa,FL,39,F,20:43:19,Sarah Raaymakers

### 1 - Removendo colunas Nome e Sobrenome

In [26]:
data_2024.drop(['First_Name', 'Last_Name'], axis=1, inplace=True)

In [27]:
data_2023.drop(['First_Name', 'Last_Name'], axis=1, inplace=True)

### 2 - Dividindo os dataset

In [31]:
# Filtrando os candidados que nao conseguiram concluir a prova

data_2023[data_2023['Time'] == 'Did Not Finish'].head(3)

    Place              City State  Age Gender            Time       Full_name
48      0       Brooksville    FL   62      M  Did Not Finish    Andy Mathews
49      0            Odessa    FL   61      F  Did Not Finish     Pam Dickens
50      0  New Smyrna Beach    FL   61      M  Did Not Finish  Chris Goodreau

In [34]:
data_2023_finishers = data_2023[data_2023['Time'] != 'Did Not Finish'].copy()

In [35]:
data_2024_finishers = data_2024[data_2024['Time'] != 'Did Not Finish'].copy()

In [36]:
data_2023_dnf = data_2023[data_2023['Time'] == 'Did Not Finish'].copy()

In [37]:
data_2024_dnf = data_2024[data_2024['Time'] != 'Did Not Finish'].copy()

### 3 - Removendo colunas dos que nao finalizaram

In [38]:
data_2023_dnf.drop(['Place', 'Time'], axis=1, inplace=True)

In [39]:
data_2024_dnf.drop(['Place', 'Time'], axis=1, inplace=True)